["Amazing: Man Is In Love With Girl And No One Knows","Devastating: Woman Eats Sandwich Out Of Bowl","Safety FTW! Johnson &amp; Johnson Has Released An 8,000-Calorie Shampoo People Can Eat If They Get Trapped In The Shower","It's Nice To Remember The Good Things In Life","How The Hell Did He Swing That? This Kid’s Hat Has His Fucking Name On It","7 Things Every Bilingual Person Knows To Be True","Whoa: 1 Out Of 1,000 People Who Click On This Will Get Straight-Up Porn","Beautiful: These Students Leapt Into Action The Moment They Found Out Their Teacher’s Hogs Needed A Good Stackin’…","Fantastic news! ClickHole now has an online store where you can buy shirts, mugs, and at least one bath towel.…","Hear the stories of people who witnessed world-changing historic events in Witnessing History. \n\nLatest episode:…","If you pass this test you will be legally required to sign up with NASA and go live on Mars until you die on Mars. ,","RT @TheAVClub: What song do you wish you—and the world—could hear again for the first time?","Next Week On ClickHole","For Years, I Was A Bigot. Then I Took A Karate Class. Now I’m A Bigot Who Knows Karate.","7 Pics Of A Pug Dressed As An Ewok That You Think Are Cute Because You Didn’t Have To Listen To It Scream…","What are you going to do?","How Much Of A Romantic Are You?","It looks like this is a company that is not prepared to let its customers starve to death in the shower.","Safety FTW! Johnson &amp; Johnson Has Released An 8,000-Calorie Shampoo People Can Eat If They Get Trapped In The Showe…","Damn. How the hell did he pull that off?","How The Hell Did He Swing That? This Kid’s Hat Has His Fucking Name On It","Want To Leave Earth? Go Colonize Mars!","Beautiful: These Students Leapt Into Action The Moment They Found Out Their Teacher’s Hogs Needed A Good Stackin’…","Aretha Franklin said WHAT?!","Find Out What Ed Asner, Aretha Franklin, And Paul Krugman Have To Say","Is this the worst music video ever?","It’s Time To Admit That Depression Is Real, Except For Teens Who Are Just Being Moody","Whoa: 1 Out Of 1,000 People Who Click On This Will Get Straight-Up Porn  #NSFW","How To Contour Your Face For These 6 Easy Looks!","Here Are Pixar’s 7 Rules For Perfect Storytelling","Inspiring! We Asked 5 Successful People About The First Thing They Bought After Making Their First Million…","Incredible: Soldier Surprises His Family By Returning To Afghanistan During His Son’s Football Game","Here Are Pixar’s 7 Rules For Perfect Storytelling","7 Pics Of A Pug Dressed As An Ewok That You Think Are Cute Because You Didn’t Have To Listen To It Scream…","8 Unsung Heroes Of The American Revolution","Whoa: 1 Out Of 1,000 People Who Click On This Will Get Straight-Up Porn  #NSFW","Want To Leave Earth? Go Colonize Mars! ,","If You Don’t Think You Have Any Racial Prejudices, You Better Watch This Video","Customer Service FTW: When This Woman Complained On Twitter About Her Keurig Not Working, Keurig Beheaded Their CEO…","One Last Humiliation: The CIA Bungled An Attempt To Drop A Piano On Fidel Castro’s Funeral Procession…","Wow.","The Necks Of Wealth: Here Are 7 Billionaires’ Throats","16 Grapes That, When Arranged Just So, Resemble A Hugely Muscular Ant","RT @ClickHole: Inspiring: Mothers Tell Their Daughters What They Wish They Had Known About Being A Woman","RT @TheAVClub: Donald Trump makes cinema great again on this troubling Instagram account","Buzz Lightyear’s greatest torment is that he can never become naked.","Here Are Pixar’s 7 Rules For Perfect Storytelling","Did you get it?","7 Pics Of A Pug Dressed As An Ewok That You Think Are Cute Because You Didn’t Have To Listen To It Scream…","If you pass this test you will be legally required to sign up with NASA and go live on Mars until you die on Mars.","Want To Leave Earth? Go Colonize Mars!","If you don’t get it on your first try, just refresh the page to try again!  #NSFW","Whoa: 1 Out Of 1,000 People Who Click On This Will Get Straight-Up Porn  #NSFW","Wow! Props to Keurig for taking customer satisfaction so seriously!","Customer Service FTW: When This Woman Complained On Twitter About Her Keurig Not Working, Keurig Beheaded Their CEO…","Steven Spielberg said WHAT?!","Find Out What Mark Zuckerberg, Janet Yellen, And Steven Spielberg Have To Say","Supercut Of Every Time Oprah Said ‘The Vultures Are Waiting To Pick Your Bones’ On Her Show","There Better Not Be Kids Inside The School Buses They Drive Over At Monster Truck Shows","The Necks Of Wealth: Here Are 7 Billionaires’ Throats","Do You Got What It Takes To Make It In This Town?","One Last Humiliation: The CIA Just Bungled An Attempt To Drop A Piano On Fidel Castro’s Funeral Procession…","6 Legendary Hip-Hop Feuds","Amazing: Man Is In Love With Girl And No One Knows","Wow.","Wow, talk about going out strong.","Watch The White Building Closely","The Necks Of Wealth: Here Are 7 Billionaires’ Throats","One Last Humiliation: The CIA Just Bungled An Attempt To Drop A Piano On Fidel Castro’s Funeral Procession…","Moms are the best.","11 Things All Women Who Lift Weights Are Sick Of Hearing","Body Positivity Win: Dove Is Offering To Freeze Women Until A Time When Their Bodies Are Conventionally Attractive","RT @TheAVClub: Panting at the threshold of your worst imaginings: The year in band names, 2016  …","RT @ClickHole: These Men Were At The Rumble In The Jungle, And Their Stories Are Incredible","Wow.","Time After Time I Refuse You And Still You Come Back To This House, Grigory?","Faith in humanity restored!","Incredible. What a way to cap off his presidency.","RT @DavidRutz: Oh man, how embarrassing. Castro keeps sticking it to the U.S., even in death!","The Necks Of Wealth: Here Are 7 Billionaires’ Throats","The CIA just proved that it cannot let its obsession with Castro go.","One Last Humiliation: The CIA Just Bungled An Attempt To Drop A Piano On Fidel Castro’s Funeral Procession…","Moms are the best.","Inspiring: Mothers Tell Their Daughters What They Wish They Had Known About Being A Woman","How Many Of These Euphemisms For Bread Do You Know?","RT @b_stahl: Can't wait to get mine in the mail!","Chris Rock said WHAT?!","Find Out What Alice Walton, Chris Rock, And Gloria Steinem Have To Say","We Don’t Know How To Make GIFs, So We Had This Guy Make A Surprised Face 200 Times In A Row","18 Insane (But True!) Sex Facts","Body Positivity Win: Dove Is Offering To Freeze Women Until A Time When Their Bodies Are Conventionally Attractive","Meet The Man Who Wrote The Song That Played During Dial-Up Internet Connections","Fighting Back: Facebook Is Mailing Air Horns To All Of Its Users To Blow Whenever They See Fake News…","Please Do Not Let Funyuns Become The Official Chip Of The Alt-Right","Play It Cool: Don’t Scroll Down Now, But David Sedaris Is In This List Of Amazing Micro-Homes…","The Rumble in the Jungle changed boxing forever.","Heartwarming: Chris Pratt Surprised A Terminally Ill ‘Iron Man’ Fan By Visiting Him Wearing Robert Downey Jr.’s Ski…","Body Positivity Win: Dove Is Offering To Freeze Women Until A Time When Their Bodies Are Conventionally Attractive…","Need A Pretzel Buddy? This Guy Has You Covered","How Many Of These Euphemisms For Bread Do You Know?","Jesus Christ, the nerve of this woman.","The 7 Types Of Boyfriend Every Woman Goes Through","7 People Who Have Apparently Fucked Over This Tattooed Guy Having A Loud Phone Call In A Parking Garage…","Science FTW: When This Man’s Dog Took The Good Chair, He Used A Telescope To Shove It Off","RT @TheAVClub: As Furbies grow more lifelike they become better to disembowel","Hear stories from people who witnessed world-changing events in Witnessing History.\n\nToday: The Rumble In The Jungl…","This Artist Boldly Reimagined Edward Snowden With Long Hair","Play It Cool: Don’t Scroll Down Now, But David Sedaris Is In This List Of Amazing Micro-Homes…","TAG your special someone if you’re ready for them to show you the foam!","Christopher’s slices? Brown pillow?","How Many Of These Euphemisms For Bread Do You Know?","RT @dr_nic: Finally! Some real action from Zuckerberg.","In 1974, Ali and Foreman met in Zaire to fight each other in \"The Rumble In The Jungle.\" This man was there.","These Men Were At The Rumble In The Jungle, And Their Stories Are Incredible","Can we get a “hell yeah”? This is the breath of fresh air we’ve been looking for! …","Body Positivity Win: Dove Is Offering To Freeze Women Until A Time When Their Bodies Are Conventionally Attractive…","Simms definitely faces an uphill battle, but uphill to the tune of 29,000-plus feet? Hardly.","Sorry, but no.","RT @PJTobia: Problem solved","Stevie Wonder said WHAT?!","Find Out What Stevie Wonder, Condoleezza Rice, And E.O. Wilson Have To Say","Incredible: This Innovative CPR Dummy Comes With A Second Dummy That Audibly Mourns Its Dead Son","7 Easy Meals For Anyone Too Fancy To Enjoy Oatmeal","7 People Who Have Apparently Fucked Over This Tattooed Guy Having A Loud Phone Call In A Parking Garage…","The Ultimate Hoarder? This Woman Has Kept Her Late Husband’s Letters For Over 60 Years","What A Memory! This Grandmother Names The Race Of Everyone She Saw At The Grocery Store","Turns out that not only does the guy have a big wallet, but he’s got a big heart, too.","Share if you agree!","5 Cars That Are More Expensive Because Al Capone Taught Elvis To Read Inside Of Them","Look, we know we’re probably not going to win any awards with this one, but here goes.","Looks like Facebook is finally fighting back against misinformation!","Here’s a story that will have you on your feet.","Fighting Back: Facebook Is Mailing Air Horns To All Of Its Users To Blow Whenever They See Fake News…","Use The Sliders To Give These Only Children Some Siblings!","Amazing: Man Is In Love With Girl And No One Knows","Heartwarming: Chris Pratt Surprised This A Ill ‘Iron Man’ Fan By Visiting Him Wearing Robert Downey Jr.’s Skin…","7 People Who Have Apparently Fucked Over This Tattooed Guy Having A Loud Phone Call In A Parking Garage…","Please Do Not Let Funyuns Become The Official Chip Of The Alt-Right","RT @TheAVClub: On its 25th anniversary, Achtung Baby remains U2’s defining achievement","Looks like fun.","Fantastic news, e-commerce fans! ClickHole now has an online store.","7 Nonexistent Traits To Look For In Your Next Boyfriend","Wow: Watch This Woman Totally Shut Down A Catcaller","10 Hard Truths You Learn In Your 26,350s","Al Capone taught Elvis to read inside these cars, and that amazing tie to history makes them way more expensive.…","5 Cars That Are More Expensive Because Al Capone Taught Elvis To Read Inside Of Them","How Many Of These Old Wives’ Tales Have You Heard?","Who says there are no second acts in life?","RT @TheEricGoldman: I’ve never seen #GilmoreGirls and I got Emily Gilmore! Thanks, @ClickHole!","7 People Who Have Apparently Fucked Over This Tattooed Guy Having A Loud Phone Call In A Parking Garage…","Dwayne \"@TheRock\" Johnson said WHAT?!","Find Out What Dwayne Johnson, Scarlett Johansson, And Gene Hackman Have To Say","This Might Not Be ‘PC’ Enough For You Overly Sensitive Social Justice Warriors, But All Of The Planets Are Men…","Please Do Not Let Funyuns Become The Official Chip Of The Alt-Right","Who Gives A Fuck?","Beautiful: Cobra Honors The Troops","6 Steps To Take Immediately When Your Identity’s Been Stolen","Heartwarming: Chris Pratt Surprised A Terminally Ill ‘Iron Man’ Fan By Visiting Him Wearing Robert Downey Jr.’s Ski…","Watch What Happens When We Drop Wallets In Front Of Homeless People","So Fired: 8 Disastrous ‘Reply All’ Work Emails","An American Myth: Jerry Siegel And Joe Shuster’s Original Notes For Superman Are A Must-Read","6 Sizzling Noises That Only ’90s Meat Eaters Will Understand  #Sponsored","RT @ClickHole: Great news, e-commerce fans! ClickHole now has a store where you can buy shirts, mugs, and at least one bath towel. https://…","Wasteful: The Navy Loses Over $45 Billion A Year To Submarines Sneaking Off With Whales And Living With Them Foreve…","‘The Door Noises Made Us Deaf’: An Oral History Of ‘Star Trek’","Death With Dignity: Oregon Has Announced Plans To Provide Periscopes To People Sinking In Quicksand","Are You A Gym Rat?","5 Foods You’ve Been Eating Completely Wrong","Insane Speed-Reader Tears Through 2,500-Word Warranty Agreement In 4 Seconds","7 People Who’ve Made Out With Your Sister","After 55 Years Of Research, Jane Goodall Shares Her 6 Most Fascinating Discoveries About Chimpanzees","Heartwarming: This Super Dad Refuses To Leave The Casino Until He Wins His Daughter’s Tuition Money Back","Even If You Haven’t Seen It, You’re Gonna Have A Good Time On This “Which ‘Gilmore Girls’ Character Are You?” Quiz…","6 Apple-Picking No-No’s To Avoid If You Don’t Want To End Up In The Punishment Orchard","How Many Of These Things Did You Google Immediately After Watching ‘The Social Network’?","Great news, e-commerce fans! ClickHole now has a store where you can buy shirts, mugs, and at least one bath towel.…","It’s pretty difficult to overstate what a huge leap forward this is for animal rights.","‘90s Sitcoms With The Verbs Cut Out","We Put A GoPro On A Sparrow","‘The Door Noises Made Us Deaf’: An Oral History Of ‘Star Trek’","You Shouldn’t Have Made Fun Of My Exclamation Point","Incredible: This Innovative CPR Dummy Comes With A Second Dummy That Audibly Mourns Its Dead Son","This awesome makeup tutorial shows you how to throw together a false face to fool wolves in no time.","Heartwarming: Chris Pratt Surprised A Terminally Ill ‘Iron Man’ Fan By Visiting Him Wearing Robert Downey Jr.’s Ski…","These shirts, mugs, and hoodies will become treasured heirlooms, so get them before someone less deserving does!","Shocking: A Harrowing Look At Our Nation’s Underfunded Planet Hollywoods","What’s even more amazing is that Trump didn’t seem to want any credit or praise for this benevolent deed.…","Help These Oafs Get Their Shirts Over Their Heads","How Many Of These Home Remedies For A Cold Have You Tried?","This Black Friday, trample other shoppers from the comfort of your own home with ClickHole's brand new store!…","This Slightly Misinformed Woman Is Buying Up As Much Deodorant As She Can For The Next Four Years…","Finally! Gina Has Managed To Catch Herself A Man!","6 People Who Came To My Garage Sale Who Seem To Be Sticking Around For Dinner","7 Famous Dogs From The ’90s That Are Definitely Dead Now","Disgrace: The CEO Of Beans Has Stepped Down Amid Reports That There Can’t Be A CEO Of Beans","How Many Of These Classic ‘Peanuts’ Specials Have You Seen?","Total Choke: Employee Knocks Over Boiling Cauldron During The Most Important Board Meeting Of The Year","His Own Way: This College Student Refuses To Let His Parents Pay For Anything Outside Of Tuition, Rent, And Food…","Will You Survive The Winter?","Inspiring! This Dad Lowered His Basketball Rim To Dunk On His Daughter"]