{"k": ["What do u do?", "Stare at pantiesAwait reactionThen what? Depends on reaction :3", "shibuya-san is pretty clearly already reacting and it&#039;s not looking goodpersonally i would try to get a photo before getting a knee to the face", "It&#039;s not my fault she is standing above me", "Bend the back of her knees so she falls on my face :D", "fucking punt her in the cunt", "BLAST IT WITH PISS", "Tell her to get new panties", "Good dubds.", "rape murder eat the corpse", "Sniff sniff sniff", "smash my face into it", "inhale deeply", "Wonder where it all went wrong.", "Quoting what I&#039;d say.", "ask who is being quoted in this post", "its ur parents fault ur so short", "grab her by the pussy", "and dont even wait", "blush, move away, and mumble an apology.", "punch itit&#039;s not a trapit&#039;s gay", "Hehe nice 1", "wew", "Wake up.", "kiss her cameltoe and let her step on me", "dats cute, bay", "underated post", "dont be that guy", "hello friends i am here", "We can be friends", "It&#039;s nice to be friendly with people", "Cool, a bearsuit.", "Bearsuits are soft", "And made you look like a bear.", "What a nice thread so far", "Lain-chan is kuma-chan now?", "Ah Lain, I&#039;ve heard about you.What are you planning to do next on the wired? I hear it&#039;s something BIG! Some people even say that KNIGHTS are the ones pulling the strings, but I personally believe that it&#039;s been you all along!", "Who is the nicest poster?", "", "*shitposts before sleep*", "stay dryI know you can do it OP", "update: literally the minute I sat down birds outside my window started fucking chirping and they still haven&#039;t stoppednot only am I irate as fuck not birds are NOT important and if I had a flamethrower I&#039;d risk the jail tiem to teach these COCKSUCKING FUCKING FAGGOTS WHO HAD ALL DAY TO BE CUNTS BUT DECIDE THE SECOND I WANT TO SLEEP THEY&#039;D DO IT", "here is my comic. it is nice. please remember to like, favourite, and subscribe", "What a weak peer group.[s4s] elementary school is way better.", "why is small head bear get bully ;__;", "bcause bury ebil is not cool", ")", "Comic! Nice! Subscribed!", "oh whoops I forgot to post the comic", "Excitement!", "high school sweetheart", "my mom came to school with me today lol", "then wut happened?", "sorry it took me a while", "whoops I forgot to add text", "Nice doubles! Chaiked!", "REMOVE TALKING PET", "10 / 10outta&#039; ten!", "next part", "the plot gets thiccens around the thighs and derriere region", "could someone please BEE nice and save all of these for me? thanke you", " (OP) actual cancer", "I like seeing into the secret world of bearies", "", "bzzzzbzzzzzlole", "Nice that&#039;s the same anime classroom as this video https://youtu.be/h2rIn-5XPdM", "Do you have the background image for this? I&#039;ve been looking for it.", "nice comic i red it", "wew", "here you go", "please i need someone to save these pleas help", "Plot twist now", "if this thread isn&#039;t stickies, I will DELETE EVERY SINGLE EMEME FROM THE ENGIRE INTERNET worship Lain as your new god queen or else! Think of the MEMES", "i keep falling asleep trying to watch lain. I&#039;m not trying to be an asshole, I just have a poor attention span/bad sleep schedule. how do I fix this", "Lets all love lain!", "wake up then watch lain", "touch your benis every time you see lain or hear her name. You will start to associate Lain with benis touching and your brain will wake you upbut whatever you do DO NOT SECUALIZE THE LAIN", "let&#039;s all fuck lain!", "start not having shit taste", "Reported", "faggot normie detected", "Lain is not for secks.", "let&#039;s drink lain&#039;s pee! let&#039;s take her clothes off and fuck her with all our strenght and then lick her GLORIOUS AND BIG PUSSY", "it&#039;s a very relaxing show so I don&#039;t blame you even though I&#039;d never fall asleep watching lain", "that means you&#039;re a normie, get the fuck out to facebook and never come back here at least you have learned to love lain", "", "DO NOT SEXUALIZE THE LAIN", "but she&#039;s so cute and tier how couldn&#039;t you sexualize? i want protect her forever and ever and wake up and see her smile everyday ):", "love her like you love God not like you &quot;love&quot; a warm hole you want to fuck dibs checkam", "nice", "but i deserve her! please let me marry her!", "I love Lain", "she&#039;s mine", "we love Lain?", "let&#039;s all love lain!", "yes sempai desu", "That means you would have to delete yourself lmao", "Your moms a meme", "hey guys can we talk about bycicles now", "yea", "noonly if you get dubs", "Would swaglord sticky [s4s]?", "Madman is asleep, post edits", "would swaglord sticky swaglord", "no!!! he&#039;d never do that!!!", "Sounds quite erroneous", "w", "WWWWWWWWWWWWWWWWW", "rude board", "I don&#039;t get it", "He isn&#039;t a smallhread.", "Name your price.", "About tree fiddy. Not for sexual", "whats it for", "Friend", "succi succi five dorrar", "sent", "But in all seriousness I make £400 on good nights.I make the big bucks when I receive gigs at parties of wealthy business men. I can make 2-5k depending on tips getting passed around from person to person.", "wait are you a gril", "i&#039;ve ´literally only had bad experiences with women ever since i was born i never understood any woman in my family and while i can&#039;t say i&#039;m a homosexual i think this is a big part of why i&#039;m an anime loser right now posting on an anime imageboard and why gender equality is fucking autism because it creates people like me when women have any power but then again what do i know i am still just an anime loser posting anime", "oh god my dickstory time", "Your product is broken, I require item in good condition.", "please elaborate", "I offer five (5) *cha-ching*", "(4) dolar", "three (3) united states dollars (USD)but it&#039;ll have to wait until I get my allowance.", "in this thread: post", "Where is the another leg?", "hi is this nice board", "where did u get this picture of my gf?", "Show your tits or gtfo", "You got kik?", "Hey you guys be nice to people what have you all come to?", "we all came to her, anon.", "You got kik?", "A-agatha?", "Can&#039;t argue with that name.", "she is friend with beary :3", "No this bad bully board", "", "What if not understanding constructivism is like not having a sense of humor?", "I think you need to speak louder and in Italian.", "", "", "", "The pigeonhole principle does not imply bijectivity in the infinite case, which is OK since there are only finitely many numbers, if you think about it.This makes epi mono factorization trivial though.", "good quandry my dude", "Is Perfect Compression the algorithm that is efficient for all data sets?Or is it the algorithm that is infinitely efficient, for even only one data set?", "Lossless compression is nothing other than relabeling. You can&#039;t win with one data type without losing an equivalent amount in another.The gains from compression exist because one has a lot of reduncancy information that isn&#039;t used in the present representation.", "", "From the thumbnail it looks like the woman on the right is puking.", "Whom are you quoting?", "yea the russians sure were on to something when they eliminated representation from art", "E=MC^2", "gets", "u sixk"]}