["RT @OnionLabs: .@PeteHolmes + #FacesAndSounds = one great comedy special premiering tonight at 10pm on @HBO.","Sick Man Slowly Becoming Enthroned In Used Tissues","Roommate Protective Services Rescues Helpless 22-Year-Old From Squalid Apartment","Poll: 78% Of Americans Hope Cataclysmic Event Wiping Out Humanity Will Have Big Tidal Wave","Pit Of Komodo Dragons Shocked To Discover Billionaire Who Owns Them Is Just 26","RT @ClickHole: 7 Pics Of A Pug Dressed As An Ewok That You Think Are Cute Because You Didn’t Have To Listen To It Scream …","Dancing 7-Year-Old Looks To Expand Fan Base From Parents To Parents’ Friends","Empty ‘About Us’ Page Leaves Chinese Buffet’s Origins Shrouded In Mystery","Dog Not Sure It Ready To Tackle Whatever Happened To Man At Work Today","\"You’d have to be an idiot not to use them,” said defensive coordinator Brent Pry.","‘Rocky’ Turns 40  #WhatDoyouThink?","In today's news: Ruth Bader Ginsburg, song lyrics, and Christmas lights","For more world-renowned reportage, visit .","RT @TheAVClub: Thanks to the internet, Mike Pence is one of Planned Parenthood’s biggest donors  …","Real Estate Terms To Know","Broken Ornament Relegated To Lonely Existence On Side Of Tree Facing Wall","RT @ClickHole: How The Hell Did He Swing That? This Kid’s Hat Has His Fucking Name On It","RT @OnionSports: Best Sports Video Games Of All Time","Reason Man Turning To Religion Later In Life Must Be Horrifying","Channel all of your deep-seated resentment toward corporate America into repeatedly clicking this link.…","5 Things To Know About James Mattis","Man Who Baked Banana Bread Spends Entire Party Anxiously Watching It Go Uneaten","RT @OnionStore: Find the perfect gift for that special anyone at the Onion Store.","What Smoking A Cigarette Does To The Body","Ruth Bader Ginsburg Debating Whether To Cancel Winter Vacation Climbing K2","RT @OnionLabs: Man who craves burger and wants to spend under $7 wishes for a place that satisfies both needs  https…","How To Stay Politically Active After The Election","Reddit Cracks Down On ‘Toxic’ Users  #WhatDoyouThink?","Halloween Decorations Blending In Nicely With Christmas Lights","Man Confidently Hits ‘Send’ On Worst Job Application Company Has Ever Seen","Dunbar Family Forced To Discontinue Print Edition Of Christmas Newsletter","New Report Shows Many U.S. Businesses Actually Just Fronts For Moneymaking Operations","Algebra Notebook Forced To Bear The Brunt Of Teen’s Song Lyrics","RT @ClickHole: Want To Leave Earth? Go Colonize Mars!","Man Doesn’t Know How Parents Ever Going To Pay Off Massive Student Loan Debt","RT @OnionLabs: Botched Chin Jobs And Seasonal Coughs","NYPD Lets Suspicious Man Go After Only Finding ‘Catcher In The Rye’ In Backpack","RT @TheAVClub: Trevor Noah has his best interview yet with living Facebook screed Tomi Lahren  …","In today's news: Cancer research, Christmas gifts, and a career change","RT @OnionSports: Fan Not Ready To Leave Warmth Of Piss-Soaked Stadium Bathroom","National News Highlights:","RT @OnionLabs: .@PeteHolmes makes his @HBO debut, Saturday at 10PM on @HBO. #FacesAndSounds","PTSD Treated With Ecstasy  #WhatDoYouThink?","5 Things To Know About The Dakota Access Pipeline","Can Trump Follow Through On His Campaign Promises?","RT @ClickHole: Whoa: 1 Out Of 1,000 People Who Click On This Will Get Straight-Up Porn  #NSFW","Mom Wants One Of Those Things Your Sister Has For Christmas","Visit  to see more from the standard bearer of global journalism.","RT @OnionLabs: The schematics behind one of the many elegant products from The Cheetos Store - Toilet Paw-Per  https…","Facebook User Verifies Truth Of Article By Carefully Checking It Against Own Preconceived Opinions…","Tips For Reducing Your Screen Time","Religion Triggers Brain’s Reward Centers  #WhatDoYouThink?","Cancer Researchers: ‘Don’t Get Cancer’","Michelle Obama Throws Out A Bunch Of Barack’s Old Number 44 Jerseys","Sad 38-Year-Old Googles 'Jobs Caring For Baby Animals'","Consumer Entering That Awkward Age Between Target Demographics","Woman Always Dreamed Of Opening Her Own Sparsely Attended Dance Studio","Local Applebee's Removes Photo Of Underperforming Pop Warner Team","RT @ClickHole: Inspiring: Mothers Tell Their Daughters What They Wish They Had Known About Being A Woman","'Vogue' Assistant Photo Editor Tasked With Airbrushing Out All Of Amy Adams' Swastika Tattoos…","In today's news: A Supreme Court ruling, Obama fulfills a campaign promise, and Andy García","Bard College Named Nation's No. 1 Dinner Party School","RT @TheAVClub: .@DanHarmon's universal theory of storytelling gets an animated explainer","Study: Tennis Leads To Longer Life  #WhatDoyouThink?","For the latest from the world’s most unstoppable media juggernaut, visit .","Dinner Party Conducting Full-Scale Investigation To Determine If Tip Was Included","RT @ClickHole: One Last Humiliation: The CIA Just Bungled An Attempt To Drop A Piano On Fidel Castro’s Funeral Procession …","How To Talk To Your Child About Racism","Obama Finally Fulfills Campaign Promise To Spend One Night In Abandoned Amusement Park","RT @OnionLabs: Capricorn: The Sun is in your sign this week. Get a burger w/an egg on it! You wild one! OK, put your shirt back on. https:/…","Parents Wish Weak-Willed Daughter Would Push Back Against Violin Lessons Just A Little","Did You Know?","California Weighs Ban On Lawyer-Client Relations  #WhatDoyouThink?","Man Sleeps Through His Stop On Elevator","Disgusted Supreme Court Can't Believe It Has To Rule Having Sex With American Flag Protected Under First Amendment…","High School Freshman Thinks ‘Romeo And Juliet’ Might Just Be Her Favorite Play","Geese All Flying To Andy García's House For Winter","Death Row Guard Has Always Had Soft Spot For The Innocent Ones","RT @avsupperclub: Rediscover the long-lost Saturn cocktail, a rare tiki drink using gin","Hundreds Killed In Brutal Pro-Something–Anti-Something Clash","RT @ClickHole: These Men Were At The Rumble In The Jungle, And Their Stories Are Incredible","Middle-Aged Woman So Tired Of Going Back And Forth Between Divorced Parents’ Nursing Homes","RT @TheAVClub: Failing media to be replaced by 24-hour Taylor Swift channel","Chinese Buffet Has French Fries","In today's news: A Macy's parade float, an FDA recall, and white male privilege","Charleston Shooter To Represent Self In Court  #WhatDoyouThink?","For more exemplary journalism, visit .","RT @OnionLabs: The schematics behind one of the many elegant products from The Cheetos Store - The @ChesterCheetah Oven Paw …","Man To Continue Slowly Drifting Into Middle Of Restaurant Until Host Redirects Him","5 Things To Know About Trump's Conflicts Of Interest","Editorial Cartoon: \"Unhappy Days\"","Tips For Making A Great First Impression","“I wouldn’t trade those 40-some-odd months for anything.”","RT @ClickHole: Fighting Back: Facebook Is Mailing Air Horns To All Of Its Users To Blow Whenever They See Fake News …","Our relations with our corporate partners remain more pure and beautiful than anything you'll ever experience.…","Today's weather report:","Your Horoscopes – Week Of November 29, 2016","India Aims For Cashless Society  #WhatDoyouThink?","Job Applicant Totally Nails Interview With Person Who Will Make Life A Living Hell For Next 5 Years…","Woman Who Had Almost Formed Healthy Sense Of Self Rejoins Social Media","White Male Privilege Squandered On Job At Best Buy","FDA Recalls Food","SeaWorld Employees Place Orcas In Plastic Bags Of Water While Cleaning Tanks","RT @ClickHole: Amazing: Man Is In Love With Girl And No One Knows","Man Was Himself For 27 Minutes Today","RT @TheAVClub: On its 25th anniversary, Achtung Baby remains U2’s defining achievement","Girlfriend To Stay Underneath Blanket For Next 5 Months","Macy’s Parade Float Covered In Tickets After Parking On 5th Avenue Over Holiday Weekend","In today's news: Depression on the rise, a mailroom worker, and a coworker with two computer screens","To see more unmatched reporting, visit .","5 Things To Know About The Election Recount","Holiday Shopping By The Numbers","Fidel Castro Dies  #WhatDoyouThink?","Did You Know?","How To Throw The Perfect Surprise Party","RT @ClickHole: 7 Nonexistent Traits To Look For In Your Next Boyfriend","Study: Depression Up Among Teenage Girls Able To Perceive Any Part Of World Around Them","Cuban Army Honors Fidel Castro With 21-Gun Firing Squad","How Virtual Reality Will Change Our Lives","Poll: 78% Of Americans Hope Cataclysmic Event Wiping Out Humanity Will Have Big Tidal Wave","RT @OnionLabs: Cartoon: Talk is Cheap","Sexism Potentially Harmful To Men’s Health  #WhatDoyouThink?","The Week In Pictures – Week Of November 28, 2016","Coworker With Two Computer Screens Not Fucking Around","Half-Dressed Man Frantically Scrambles Out Of Home After Hearing Toyotathon Deals Won't Last Long…","Sweating, Trembling Mom Still Coming Down From High Of Having Kids Under One Roof","Moronic Mailroom Worker Worked Way Down From CEO","RT @ClickHole: Incredible: This Innovative CPR Dummy Comes With A Second Dummy That Audibly Mourns Its Dead Son","Woman Takes Short Half-Hour Break From Being Feminist To Enjoy TV Show","Unclear Whether Grandpa Having Good Time","34-Year-Old Asks For Big Piece","Area Dad Convinced Receiver Controlled Ball, Got Both Feet Inbounds","Divorced Friend Burning Through New Hobbies At Unsustainable Rate","USDA Rolls Out New School Brunch Program For Wealthier School Districts","RT @OnionStore: Shop on The Onion Store now. We have the shirts, you have the arms.","Mom Really Gunning To Befriend Babysitter During Weekly 3-Minute Interactions","Editorial Cartoon: \"Fear-icle on 34th Street\"","RT @ClickHole: Insane Speed-Reader Tears Through 2,500-Word Warranty Agreement In 4 Seconds","Seasonal Depression To Take Over For Chronic Depression For A Few Months","What You Need To Know About The Dakota Access Pipeline","Total Nerd Actually Owns His Own Computer","Historians Piece Together Carnival East India Company’s First Cruise In 1605","Family Worried Where Grandma Going With Conversation On Low-Income Housing","It Kind Of Sweet CEO Thinks He Doing Good Job","Vacationing Man Excited To Try Fast Food Franchise Not Found In Hometown","Man Wakes From Nightmare Relieved It Only Expression Of His Real-Life Problems","RT @ClickHole: We Put A GoPro On A Sparrow","Parents Finally Cave And Buy 33-Year-Old Son PlayStation 1","RT @ClickHole: 7 Famous Dogs From The ’90s That Are Definitely Dead Now","Online Shopping vs. In-Store Shopping","Tips For Getting Out Of Debt","For more world-renowned reportage, visit .","42 Million Dead In Bloodiest Black Friday Weekend On Record","Black Friday By The Numbers","Wrong Turn Finds Man On Poor Side Of Mall","Video Game Aims To Diagnose Alzheimer’s  #WhatDoyouThink?","RT @TheAVClub: The best Black Friday deals available right now, via @KinjaDeals","20,000 Sacrificed In Annual Blood Offering To Corporate America","Black Friday Deals","Everyone In Family Compliments Grandmother On How Small And Feeble She’s Gotten","RT @TheAVClub: WKRP celebrates Thanksgiving by tossing turkeys out of a helicopter","Infertile Aunt Doing It Up Big At Kids Table","Weird Wooden Chair Pressed Into Service For Thanksgiving","Visit  to see more from the standard bearer of global journalism.","BREAKING: Cousin Mark Coming After All","How To Cut Down On Food Waste","Parents Officially Designate Upstairs Television For Anyone Who Doesn’t Want To Watch Thanksgiving Football…","RT @ClickHole: Can You Keep Up A Conversation With Your Dad? ,","Americans Celebrate Thanksgiving  #WhatDoyouThink?","Younger Cousin’s Growth Spurt Throws Off Competitive Balance At Family’s Thanksgiving Touch Football Game…","Thousands Of Rats Tumble About Uncontrollably Inside Snoopy Balloon High Above Thanksgiving Day Parade…","Thanksgiving Affords Nation Rare Opportunity To Eat Large Amounts Of Food While Watching Football…","New Balloons In This Year's Macy's Thanksgiving Day Parade","RT @ClickHole: Please Do Not Let Funyuns Become The Official Chip Of The Alt-Right","26-Year-Old To See Every Asshole He Ever Went To High School With On Night Before Thanksgiving…","RT @avsupperclub: Learn the Hotel Nacional Special, an extra smooth take on the pineapple daiquiri  …","Poll: Do You Plan To Start Shopping On Thanksgiving Day?","RT @ClickHole: Incredible: This Innovative CPR Dummy Comes With A Second Dummy That Audibly Mourns Its Dead Son","For the latest from the world’s most unstoppable media juggernaut, visit .","RT @OnionLabs: Laura met Miles today and had an instant connection. You might too. Meet Miles at @BP_America today …","5 Most Common Health Myths","RT @TheAVClub: More than Gilmore: 24 other TV shows to binge over Thanksgiving weekend","Only College Student Staying On Campus Planning Saddest Thanksgiving Meal Of All Time","RT @ClickHole: Turns out that not only does @realDonaldTrump have a big wallet, but he’s got a big heart, too.  http…","Last-Minute Holiday Travel Tips","RT @OnionLabs: Point/Counterpoint - A show in which a young 20yo debates an older 20yo. This episode: Thanksgiving …","Sweden Debuts ‘Mansplaining’ Hotline  #WhatDoyouThink?","Grandson Has Long Hair","The Onion's Guide To Hosting A Perfect Thanksgiving","Man At Airport Pissed That Other People Had Same Idea To Go Home For Thanksgiving","RT @ClickHole: Makeup Tutorial: How To Make A False Face To Fool Wolves In Less Than 30 Minutes","Nation's Uncles Enter Last Stage Of Prep For Thursday's Thanksgiving Debates","RT @OnionLabs: With raving reviews like these, why would you buy any other bacon than @Applegate Natural Sunday Bacon? …","6-Year-Old Shits Out Half-Assed Hand Turkey","RT @TheAVClub: Don’t heckle Anthony Bourdain about eating dogs","The Onion’s Tips For Traveling Over The Holidays","In today's news: The Carnival East India Company, a divorced friend, and mainstream media bias","RT @ClickHole: Wasteful: The Navy Loses Over $45 Billion A Year To Submarines Sneaking Off With Whales And Living With Them Forever https:/…","For more exemplary journalism, visit .","RT @OnionLabs: If this older brother gets to order a milkshake, then his younger brother should be allowed to too  h…"]